"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""

import sys

hours, salary_per_hour, bonus = map(float, sys.argv[1:])
print('Salary - {}'.format(hours * salary_per_hour + bonus))
